Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьСборкиРазборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПредставленияНабораВПечатныхФормах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПредставленияНаборовВПечатныхФормах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВариантыКомплектацииНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует таблицу комплектующих номенклатуры.
//
// Параметры:
//  ВариантКомплектации	 - СправочникСсылка.ВариантыКомплектацииНоменклатуры - ссылка на вариант комплектации.
//  Упаковка			 - СправочникСсылка.УпаковкиЕдиницыИзмерения		 - ссылка на справочник упаковки или неопределено.
//  Количество			 - Число											 - число, количество комплектов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица комплектующих.
//
Функция ПолучитьКомплектующиеНоменклатуры(ВариантКомплектации, Упаковка = Неопределено, Количество = 1) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	&КоличествоКомплектов * Товары.КоличествоУпаковок / Товары.Ссылка.Количество КАК КоличествоУпаковок,
	|	&КоличествоКомплектов * Товары.Количество / Товары.Ссылка.Количество КАК Количество,
	|	Товары.ДоляСтоимости КАК ДоляСтоимости
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ВариантКомплектации);
	Запрос.УстановитьПараметр("КоличествоКомплектов", Количество);
	
	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКомплектующих;

КонецФункции

// Функция возвращает основной вариант комплектации.
//
// Параметры:
//  Номенклатура		 - СправочникСсылка.Номенклатура - 
//  Характеристика		 - СправочникСсылка.ХарактеристикиНоменклатуры - 
// 
// Возвращаемое значение:
//  СправочникСсылка.ВариантыКомплектацииНоменклатуры - на основной вариант комплектации.
//
Функция ПолучитьОсновнуюКомплектацию(Номенклатура, Характеристика) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК Таблица
	|ГДЕ
	|	Таблица.Владелец = &Номенклатура
	|	И Таблица.Характеристика = &Характеристика
	|	И Таблица.Основной
	|");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция формирует массив реквизитов для блокировки редактирования
// 
// Возвращаемое значение:
//  Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("Характеристика");
	Результат.Добавить("Товары;ТоварыУстановитьОсновнымКомпонентом,ТоварыУстановитьОсновнымКомпонентомКонтекст");
	Результат.Добавить("ВариантПредставленияНабораВПечатныхФормах");
	Результат.Добавить("ВариантЗаданияЦены; ВариантЗаданияЦены, ВариантЗаданияЦеныНазначаетсяНаНабор");
	Результат.Добавить("ВариантРаспределенияЦены");
	
	Возврат Результат;

КонецФункции

// Функция проверяет принадлежность варианта комплектации номенклатуре\характеристике,
//  и подбирает основной вариант.
//
// Параметры:
//  ВариантКомплектации	 - СправочникСсылка.ВариантыКомплектацииНоменклатуры - 
//  Номенклатура		 - СправочникСсылка.Номенклатура - 
//  Характеристика		 - СправочникСсылка.ХарактеристикиНоменклатуры - 
// 
// Возвращаемое значение:
//  Структура - содержит следующие ключи:
//    * ПринадлежитНоменклатуреХарктеристике - Булево -
//    * ОсновнойВариантКомплектации          - СправочникСсылка.ВариантыКомплектацииНоменклатуры - 
//
Функция ПроверитьПринадлежностьВариантаКомплектации(ВариантКомплектации, Номенклатура, Характеристика) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &ВариантКомплектации
	|	И Таблица.Владелец = &Номенклатура
	|	И Таблица.Характеристика = &Характеристика
	|;
	|///////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК Таблица
	|ГДЕ
	|	Таблица.Владелец = &Номенклатура
	|	И Таблица.Характеристика = &Характеристика
	|	И Таблица.Основной
	|";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ПринадлежитНоменклатуреХарктеристике = Не МассивРезультатов[0].Пустой();

	Выборка = МассивРезультатов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ОсновнойВариантКомплектации = Выборка.Ссылка;
	Иначе
		ОсновнойВариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Возврат Новый Структура("ПринадлежитНоменклатуреХарктеристике, ОсновнойВариантКомплектации",
					ПринадлежитНоменклатуреХарктеристике,
					ОсновнойВариантКомплектации);
КонецФункции

// Обновляет количество комплектующих в табличной части по известному количеству комплектов и варианту комплектации
//
// Параметры:
//  ТаблицаКомплектующих - ДанныеФормыКоллекция	 - Табличная часть заказа на сборку либо документа "Сборка товаров".
//  КоличествоКомплектов - Число				 - для данного количества комплектов будут получены данные о комплектующих по вараинту комплектации.
//  ВариантКомплектации	 - Справочникссылка.ВариантыКомплектации - Вариант комплектации.
//
Процедура ОбновитьКоличествоКомплектующихПоКоличествуКомплектов(ТаблицаКомплектующих, КоличествоКомплектов, ВариантКомплектации) Экспорт

	ТаблицаВариантаКомплектации = ПолучитьКомплектующиеНоменклатуры(ВариантКомплектации, , КоличествоКомплектов);

	ТаблицаВариантаКомплектации.Свернуть("Номенклатура, Характеристика, Упаковка", "Количество, КоличествоУпаковок");
	ТаблицаВариантаКомплектации.Индексы.Добавить("Номенклатура, Характеристика, Упаковка");

	//Определим превышения количества по варианту комплектации относительно документа.
	СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Упаковка");
	ВГраница = ТаблицаКомплектующих.Количество() - 1;
	Для Счетчик = 0 По ВГраница Цикл

		Индекс = ВГраница - Счетчик;
		СтрокаТЧ = ТаблицаКомплектующих[Индекс];

		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
		СтрокиКомплектующих = ТаблицаВариантаКомплектации.НайтиСтроки(СтруктураПоиска);
		Если СтрокиКомплектующих.Количество() = 0 Тогда //комплектующей нет в варианте комплеткации
			Продолжить;
		КонецЕсли;

		Комплектующая = СтрокиКомплектующих[0];
		Если Комплектующая.Количество = 0 Тогда

			ТаблицаКомплектующих.Удалить(Индекс);

		Иначе

			ОстатокПоВарианту = Комплектующая.Количество - СтрокаТЧ.Количество;

			Если ОстатокПоВарианту >= 0 Тогда
				Комплектующая.Количество = ОстатокПоВарианту;
				Комплектующая.КоличествоУпаковок = Комплектующая.КоличествоУпаковок - СтрокаТЧ.КоличествоУпаковок;
			Иначе
				СтрокаТЧ.Количество         = Комплектующая.Количество;
				СтрокаТЧ.КоличествоУпаковок = Комплектующая.КоличествоУпаковок;
				Комплектующая.Количество = 0;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	//Обновим количество в существующих строках.
	Для Каждого СтрокаТЧ Из ТаблицаКомплектующих Цикл

		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
		СтрокиКомплектующих = ТаблицаВариантаКомплектации.НайтиСтроки(СтруктураПоиска);
		Если СтрокиКомплектующих.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Комплектующая = СтрокиКомплектующих[0];
		Если Комплектующая.Количество > 0 Тогда
			СтрокаТЧ.Количество         = СтрокаТЧ.Количество + Комплектующая.Количество;
			СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок + Комплектующая.КоличествоУпаковок;
			Комплектующая.Количество = 0;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатуры.Владелец.ТипНоменклатуры КАК ТипНоменклатуры
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", Параметры.Ключ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ТипНоменклатуры  = Выборка.ТипНоменклатуры;
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Справочник.ВариантыКомплектацииНоменклатуры.Форма.СоставНабора";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
